{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "Conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "bn_Conv1/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/beta", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn_Conv1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_depthwise_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "expanded_conv_project/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "expanded_conv_project_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_project_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "expanded_conv_project_BN/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block_1_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block_1_expand_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_1_expand_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_1_expand_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_1_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block_1_depthwise_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_1_depthwise_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_1_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_1_project/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "block_1_project_BN/gamma", "shape": [24], "dtype": "float32"}, {"name": "block_1_project_BN/beta", "shape": [24], "dtype": "float32"}, {"name": "block_1_project_BN/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block_1_project_BN/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block_2_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "block_2_expand_BN/gamma", "shape": [144], "dtype": "float32"}, {"name": "block_2_expand_BN/beta", "shape": [144], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block_2_expand_BN/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block_2_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "block_2_depthwise_BN/gamma", "shape": [144], "dtype": "float32"}, {"name": "block_2_depthwise_BN/beta", "shape": [144], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block_2_depthwise_BN/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block_2_project/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "block_2_project_BN/gamma", "shape": [24], "dtype": "float32"}, {"name": "block_2_project_BN/beta", "shape": [24], "dtype": "float32"}, {"name": "block_2_project_BN/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block_2_project_BN/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block_3_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "block_3_expand_BN/gamma", "shape": [144], "dtype": "float32"}, {"name": "block_3_expand_BN/beta", "shape": [144], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block_3_expand_BN/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block_3_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "block_3_depthwise_BN/gamma", "shape": [144], "dtype": "float32"}, {"name": "block_3_depthwise_BN/beta", "shape": [144], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block_3_depthwise_BN/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block_3_project/kernel", "shape": [1, 1, 144, 32], "dtype": "float32"}, {"name": "block_3_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_3_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_4_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_4_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_4_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_4_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_4_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_4_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_4_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_4_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_5_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_5_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_5_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_5_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_5_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_5_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "block_5_project_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block_5_project_BN/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block_6_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "block_6_expand_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_6_expand_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_6_expand_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_6_expand_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_6_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "block_6_depthwise_BN/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_6_depthwise_BN/beta", "shape": [192], "dtype": "float32"}, {"name": "block_6_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_6_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_6_project/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "block_6_project_BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "block_6_project_BN/beta", "shape": [64], "dtype": "float32"}, {"name": "block_6_project_BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block_6_project_BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block_7_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "block_7_expand_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_7_expand_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_7_expand_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_7_expand_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_7_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "block_7_depthwise_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_7_depthwise_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_7_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_7_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_7_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "block_7_project_BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "block_7_project_BN/beta", "shape": [64], "dtype": "float32"}, {"name": "block_7_project_BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block_7_project_BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block_8_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "block_8_expand_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_8_expand_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_8_expand_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_8_expand_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_8_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "block_8_depthwise_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_8_depthwise_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_8_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_8_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_8_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "block_8_project_BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "block_8_project_BN/beta", "shape": [64], "dtype": "float32"}, {"name": "block_8_project_BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block_8_project_BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block_9_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "block_9_expand_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_9_expand_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_9_expand_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_9_expand_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_9_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "block_9_depthwise_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_9_depthwise_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_9_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_9_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_9_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "block_9_project_BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "block_9_project_BN/beta", "shape": [64], "dtype": "float32"}, {"name": "block_9_project_BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block_9_project_BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block_10_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "block_10_expand_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_10_expand_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_10_expand_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_10_expand_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_10_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "block_10_depthwise_BN/gamma", "shape": [384], "dtype": "float32"}, {"name": "block_10_depthwise_BN/beta", "shape": [384], "dtype": "float32"}, {"name": "block_10_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block_10_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block_10_project/kernel", "shape": [1, 1, 384, 96], "dtype": "float32"}, {"name": "block_10_project_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_10_project_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_10_project_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_10_project_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_11_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "block_11_expand_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_11_expand_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_11_expand_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_11_expand_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_11_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "block_11_depthwise_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_11_depthwise_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_11_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_11_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_11_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"}, {"name": "block_11_project_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_11_project_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_11_project_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_11_project_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_12_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "block_12_expand_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_12_expand_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_12_expand_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_12_expand_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_12_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "block_12_depthwise_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_12_depthwise_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_12_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_12_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_12_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"}, {"name": "block_12_project_BN/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_12_project_BN/beta", "shape": [96], "dtype": "float32"}, {"name": "block_12_project_BN/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_12_project_BN/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_13_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"}, {"name": "block_13_expand_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_13_expand_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_13_expand_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_13_expand_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_13_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"}, {"name": "block_13_depthwise_BN/gamma", "shape": [576], "dtype": "float32"}, {"name": "block_13_depthwise_BN/beta", "shape": [576], "dtype": "float32"}, {"name": "block_13_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"}, {"name": "block_13_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"}, {"name": "block_13_project/kernel", "shape": [1, 1, 576, 160], "dtype": "float32"}, {"name": "block_13_project_BN/gamma", "shape": [160], "dtype": "float32"}, {"name": "block_13_project_BN/beta", "shape": [160], "dtype": "float32"}, {"name": "block_13_project_BN/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "block_13_project_BN/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "block_14_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "block_14_expand_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_14_expand_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_14_expand_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_14_expand_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_14_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "block_14_depthwise_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_14_depthwise_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_14_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_14_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_14_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"}, {"name": "block_14_project_BN/gamma", "shape": [160], "dtype": "float32"}, {"name": "block_14_project_BN/beta", "shape": [160], "dtype": "float32"}, {"name": "block_14_project_BN/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "block_14_project_BN/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "block_15_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "block_15_expand_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_15_expand_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_15_expand_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_15_expand_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_15_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "block_15_depthwise_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_15_depthwise_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_15_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_15_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_15_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"}, {"name": "block_15_project_BN/gamma", "shape": [160], "dtype": "float32"}, {"name": "block_15_project_BN/beta", "shape": [160], "dtype": "float32"}, {"name": "block_15_project_BN/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "block_15_project_BN/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "block_16_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"}, {"name": "block_16_expand_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_16_expand_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_16_expand_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_16_expand_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_16_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"}, {"name": "block_16_depthwise_BN/gamma", "shape": [960], "dtype": "float32"}, {"name": "block_16_depthwise_BN/beta", "shape": [960], "dtype": "float32"}, {"name": "block_16_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"}, {"name": "block_16_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"}, {"name": "block_16_project/kernel", "shape": [1, 1, 960, 320], "dtype": "float32"}, {"name": "block_16_project_BN/gamma", "shape": [320], "dtype": "float32"}, {"name": "block_16_project_BN/beta", "shape": [320], "dtype": "float32"}, {"name": "block_16_project_BN/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "block_16_project_BN/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "Conv_1/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"}, {"name": "Conv_1_bn/gamma", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/beta", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "Conv_1_bn/moving_variance", "shape": [1280], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1280, 3], "dtype": "float32"}, {"name": "dense/bias", "shape": [3], "dtype": "float32"}]}]}